[

	{
		"ToolName": "Nmap",
		"Creator": "Gordon Lyon",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/1nmap.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/1nmap_header.jpg",
		"Website": "https://nmap.org",
		"Stable Release": "3 Ekim 2020",
		"Description": "Nmap, að taramalarýnda ve güvenlik testlerinde sýk kullanýlan açýk kaynak kodlu bir yazýlýmdýr. Geniþ çaplý  esnek kullanýmý sayesinde güvenlik uzmanlarý tarafýndan çok tercih edilir. Að üzerindeki bilgisayarlarýn açýk portlarýnýn belirlenmesi ve burada çalýþan servislerin taranmasý gibi birçok iþlevi bulunur.  Ayrýca bilgisayarlarýn üzerinde çalýþan uygulamalarý tespit edip hangi iþletim sisteminde çalýþtýklarýný ve hangi güvenlik duvarýný kullandýklarýný öðrenebiliriz. Özgür bir yazýlým olmasý sayesinde Windows, Linux gibi birçok iþletim sisteminde çalýþabilir."
	},

	{
		"ToolName": "Snort",
		"Creator": "Martin Roesch",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/2snort.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/2snort_header.jpg",
		"Website": "https://www.snort.org",
		"Stable Release": "19 Kasým 2020",
		"Description": "Snort, IP aðlarýnda gerçek zamanlý trafik analizi ve paket kaydý yapabilen bir açýk kaynaklý að saldýrý önleme sistemidir (IPS). Protokol analizi, içerik arama ve eþleþtirme gerçekleþtirebilir ve arabellek taþmalarý, gizli port taramalarý, CGI saldýrýlarý, SMB problarý, OS parmak izi giriþimleri ve daha fazlasý gibi çeþitli saldýrýlarý ve problarý tespit etmek için kullanýlabilir. Snort’un üç ana kullanýmý vardýr. Tcpdump gibi düz bir paket dinleyicisi, bir paket kaydedici (að trafiðinde hata ayýklama için yararlýdýr) veya tam geliþmiþ bir að saldýrý önleme sistemi olarak kullanýlabilir. Çeþitli alarm mekanizmalarý sayesinde herhangi bir saldýrý tespitinden sonra kullanýcýyý uyarýr. Açýk kaynak kodlu ve ücretsiz bir yazýlým olan Snort; Linux, Windows ve MacOS platformlarýnda çalýþabilir."
	},

	{
		"ToolName": "Nessus",
		"Creator": "Tenable, Inc.",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/3nessus.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/3nessus_header.jpg",
		"Website": "https://www.tenable.com",
		"Stable Release": "20 Aðustos 2020",
		"Description": "Nessus, komut satýrý ve grafik arayüzüne sahip açýk kaynaklý, platformlar arasý bir güvenlik açýðý tarayýcýsýdýr. Þu anda kullanýlmakta olan en yaygýn güvenlik açýðý deðerlendirme araçlarýndan biridir. 1200’ün üzerinde güvenlik açýðýný yakalayabilir ve bunlar hakkýnda çeþitli biçimlerde raporlar sunabilir (HTML, LaTeX, ASCII, vs.). Bulduðu açýklar için kullanýcýya güvenlik çözümleri önerir. Linux ve Windows platformlarda çalýþýr."
	},

	{
		"ToolName": "Tripwire",
		"Creator": "Tripwire, Inc.",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/4tripwire.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/4tripwire_header.jpg",
		"Website": "https://github.com/Tripwire/tripwire-open-source",
		"Stable Release": "31 Mart 2018",
		"Description": "Tripwire sistemlerde veri bütünlüðünü analiz ve kontrol edebilmek için geliþtirilmiþ bir yazýlýmdýr.Çalýþtýðýrýldýðýnda dosya bütünlüklerini kontrol ederek bilgileri bir veritabanýnda toplar. Bir sonraki kontrol aþamasýnda bu veritabanýnda kayýtlý olan bilgilere göre herhangi bir deðiþiklik saptarsa deðiþiklikler ile birlikte rapora yansýtýr. Yalnýzca Linux’da ücretsiz olmak üzere diðer platformlarda da kullanýlabilir."
	},

	{
		"ToolName": "Suricata",
		"Creator": "Open Information Security Foundation (OISF)",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/5suricata.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/5suricata_header.jpg",
		"Website": "https://suricata-ids.org",
		"Stable Release": "4 Aralýk 2020",
		"Description": "Suricata, Açýk Bilgi Güvenliði Vakfý (OISF) tarafýndan geliþtirilen açýk kaynaklý bir tehdit algýlama motorudur. Suricata bir saldýrý tespit sistemi (IDS) ve saldýrý önleme sistemi (IPS) olarak görev yapabilir veya að güvenliði izleme için kullanýlabilir. Snort ile aralarýndaki fark, Suricata’nýn çok iþ parçacýklý olmasýdýr, yani ayný anda birden fazla çekirdek kullanabilir. Birden fazla CPU’yu kullanmak, ayný anda birden fazla olayý iþlemesine izin verir. Linux, Windows, Mac gibi platformlarda kullanýlabilir."
	},

	{
		"ToolName": "Tcpdump",
		"Creator": "The Tcpdump team",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/6tcpdump.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/6tcpdump_header.jpg",
		"Website": "https://www.tcpdump.org",
		"Stable Release": "30 Aralýk 2020",
		"Description": "Tcpdump, belirli bir arabirimdeki bir að üzerinden alýnan veya aktarýlan TCP / IP paketlerini yakalama amacýna sahip en güçlü ve yaygýn olarak kullanýlan komut satýrý paketleri dinleyicisi ve analiz aracýdýr. Linux / Unix tabanlý iþletim sistemlerinin çoðunda mevcuttur. Tcpdump ayrýca yakalanan paketleri gelecekteki analizler için bir dosyaya kaydetme seçeneði de sunar. Dosyayý tcpdump komutu veya tcpdump pcap format dosyalarýný okuyan Wireshark (Network Protocol Analyzier) adlý açýk kaynaklý GUI tabanlý bir araç tarafýndan görüntülenebilen bir pcap formatýnda kaydeder."
	}


]