[

	{
		"ToolName": "Nmap",
		"Creator": "Gordon Lyon",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/1nmap.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/1nmap_header.jpg",
		"Website": "https://nmap.org",
		"Stable Release": "3 Ekim 2020",
		"Description": "Nmap, ağ taramalarında ve güvenlik testlerinde sık kullanılan açık kaynak kodlu bir yazılımdır. Geniş çaplı  esnek kullanımı sayesinde güvenlik uzmanları tarafından çok tercih edilir. Ağ üzerindeki bilgisayarların açık portlarının belirlenmesi ve burada çalışan servislerin taranması gibi birçok işlevi bulunur.  Ayrıca bilgisayarların üzerinde çalışan uygulamaları tespit edip hangi işletim sisteminde çalıştıklarını ve hangi güvenlik duvarını kullandıklarını öğrenebiliriz. Özgür bir yazılım olması sayesinde Windows, Linux gibi birçok işletim sisteminde çalışabilir.."
	},

	{
		"ToolName": "Snort",
		"Creator": "Martin Roesch",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/2snort.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/2snort_header.jpg",
		"Website": "https://www.snort.org",
		"Stable Release": "19 Kasım 2020",
		"Description": "Snort, IP ağlarında gerçek zamanlı trafik analizi ve paket kaydı yapabilen bir açık kaynaklı ağ saldırı önleme sistemidir (IPS). Protokol analizi, içerik arama ve eşleştirme gerçekleştirebilir ve arabellek taşmaları, gizli port taramaları, CGI saldırıları, SMB probları, OS parmak izi girişimleri ve daha fazlası gibi çeşitli saldırıları ve probları tespit etmek için kullanılabilir. Snort’un üç ana kullanımı vardır. Tcpdump gibi düz bir paket dinleyicisi, bir paket kaydedici (ağ trafiğinde hata ayıklama için yararlıdır) veya tam gelişmiş bir ağ saldırı önleme sistemi olarak kullanılabilir. Çeşitli alarm mekanizmaları sayesinde herhangi bir saldırı tespitinden sonra kullanıcıyı uyarır. Açık kaynak kodlu ve ücretsiz bir yazılım olan Snort; Linux, Windows ve MacOS platformlarında çalışabilir."
	},

	{
		"ToolName": "Nessus",
		"Creator": "Tenable, Inc.",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/3nessus.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/3nessus_header.jpg",
		"Website": "https://www.tenable.com",
		"Stable Release": "20 Ağustos 2020",
		"Description": "Nessus, komut satırı ve grafik arayüzüne sahip açık kaynaklı, platformlar arası bir güvenlik açığı tarayıcısıdır. Şu anda kullanılmakta olan en yaygın güvenlik açığı değerlendirme araçlarından biridir. 1200’ün üzerinde güvenlik açığını yakalayabilir ve bunlar hakkında çeşitli biçimlerde raporlar sunabilir (HTML, LaTeX, ASCII, vs.). Bulduğu açıklar için kullanıcıya güvenlik çözümleri önerir. Linux ve Windows platformlarda çalışır."
	},

	{
		"ToolName": "Tripwire",
		"Creator": "Tripwire, Inc.",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/4tripwire.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/4tripwire_header.jpg",
		"Website": "https://github.com/Tripwire/tripwire-open-source",
		"Stable Release": "31 Mart 2018",
		"Description": "Tripwire sistemlerde veri bütünlüğünü analiz ve kontrol edebilmek için geliştirilmiş bir yazılımdır.Çalıştığırıldığında dosya bütünlüklerini kontrol ederek bilgileri bir veritabanında toplar. Bir sonraki kontrol aşamasında bu veritabanında kayıtlı olan bilgilere göre herhangi bir değişiklik saptarsa değişiklikler ile birlikte rapora yansıtır. Yalnızca Linux’da ücretsiz olmak üzere diğer platformlarda da kullanılabilir."
	},

	{
		"ToolName": "Suricata",
		"Creator": "Open Information Security Foundation (OISF)",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/5suricata.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/5suricata_header.jpg",
		"Website": "https://suricata-ids.org",
		"Stable Release": "4 Aralık 2020",
		"Description": "Suricata, Açık Bilgi Güvenliği Vakfı (OISF) tarafından geliştirilen açık kaynaklı bir tehdit algılama motorudur. Suricata bir saldırı tespit sistemi (IDS) ve saldırı önleme sistemi (IPS) olarak görev yapabilir veya ağ güvenliği izleme için kullanılabilir. Snort ile aralarındaki fark, Suricata’nın çok iş parçacıklı olmasıdır, yani aynı anda birden fazla çekirdek kullanabilir. Birden fazla CPU’yu kullanmak, aynı anda birden fazla olayı işlemesine izin verir. Linux, Windows, Mac gibi platformlarda kullanılabilir."
	},

	{
		"ToolName": "Tcpdump",
		"Creator": "The Tcpdump team",
		"ImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/6tcpdump.jpg",
		"HeaderImageURL": "https://raw.githubusercontent.com/frkngzl/H5190033FurkanGuzel/master/Images/6tcpdump_header.jpg",
		"Website": "https://www.tcpdump.org",
		"Stable Release": "30 Aralık 2020",
		"Description": "Tcpdump, belirli bir arabirimdeki bir ağ üzerinden alınan veya aktarılan TCP / IP paketlerini yakalama amacına sahip en güçlü ve yaygın olarak kullanılan komut satırı paketleri dinleyicisi ve analiz aracıdır. Linux / Unix tabanlı işletim sistemlerinin çoğunda mevcuttur. Tcpdump ayrıca yakalanan paketleri gelecekteki analizler için bir dosyaya kaydetme seçeneği de sunar. Dosyayı tcpdump komutu veya tcpdump pcap format dosyalarını okuyan Wireshark (Network Protocol Analyzier) adlı açık kaynaklı GUI tabanlı bir araç tarafından görüntülenebilen bir pcap formatında kaydeder."
	}


]
